{
    "dogs": [
      {
        "name": "Baxter",
        "ageId": 2,
        "sex": "Male",
        "bio": "Hi my name is Baxter and I'm a very good boy! My favorite things are peanut butter and getting the zoomies in the rain.",
        "adoptable": false,
        "rescueId": 2,
        "userId": 1,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647543600/s9oo5imcwndnp4oanaqm.jpg",
        "id": 1
      },
      {
        "name": "Tegan",
        "ageId": 1,
        "sex": "Male",
        "bio": "Tegan the tazmanian devil! I'm cute as a button but you better watch out cause I'll steal your socks! I love chewing up sticks and long walks on the beach.",
        "adoptable": false,
        "rescueId": 3,
        "userId": 1,
        "goodWKids": false,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647543092/tirmbeofx1tsczywy740.jpg",
        "id": 2
      },
      {
        "name": "Tucker",
        "ageId": 2,
        "sex": "Male",
        "bio": "Tucker is a 5 year old neutered male who acts like a puppy. He likes to sniff, play with toys, and go on walks with volunteers. Just look at his happy face!",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647548618/jzzulhcait15epsvj3ht.jpg",
        "id": 3
      },
      {
        "name": "Destiny",
        "ageId": 1,
        "sex": "Female",
        "bio": "Hi! I'm a 5 month old cutie looking for my new best friend and a big backyard to romp around in. I'm quickly learning my puppy basics and even pee outside now!",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "id": 4,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647456366/wzeorh3fwb6su0ivqmpl.jpg"
      },
      {
        "name": "Jacks",
        "ageId": 2,
        "sex": "Male",
        "bio": "Meet Jacks! This 5 year old, 70 lb dignified gentleman is looking for a home to call his own! Preferably one that keeps his toy basket full of toys for playtime. Jacks loves them all - stuffy, squeaky, big, small - you name it, and he’ll play with it. Despite his high enthusiasm and pride in his toys, this boys overall demeanor is pretty laidback. He would love to lounge and hang with his people and keep your company. If you are looking for a middle-aged pup that is friendly and affectionate with a well-balanced personality, Jacks may be your guy!",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647982375/hiupzdktr8npyx7kkxts.jpg",
        "id": 5
      },
      {
        "name": "Luna",
        "ageId": 2,
        "sex": "Female",
        "bio": "Adopt Luna (Luna, aka Luna Tunes, aka Lunatic)! She still has some puppy energy and rambunctiousness at times but is also an expert cuddler and enjoys napping with her people. Luna is great with other dogs, house trained, gives sweet kisses, and has the very best happy full-body wiggle.",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647459907/ftaqw9cyosoufyjtjqde.jpg",
        "id": 6
      },
      {
        "name": "Finn",
        "ageId": 2,
        "sex": "Male",
        "bio": "I'm Finn! My best friend is Baxter and I love to play with him. Sometimes my dad takes me bird hunting and that's fun cause I get to run run run!",
        "adoptable": false,
        "rescueId": 5,
        "userId": 7,
        "goodWKids": false,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647458931/zknfpcu7y46hxuys7bqe.jpg",
        "id": 7
      },
      {
        "name": "Chip",
        "ageId": 1,
        "sex": "Male",
        "bio": "Chip is a little dude, but he's got a big heart. He's got all of his basics down and he's ready to find his furever family! We suspect he's a mix including some Boston Terrier and Chihuahua. So if you're looking for the sweetest pocket pup here's your guy!",
        "adoptable": false,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647455031/w7kcfed2g4t5yomrfh5o.jpg",
        "id": 8
      },
      {
        "name": "Ranger",
        "ageId": 3,
        "sex": "Male",
        "bio": "It doesn’t get better than Ranger!! This old man has been a staff favorite since day one. This guy is the sweetest pup with a heart of gold. He loves EVERYONE and everything and will not hesitate to make you his new best friend. He’s 9 years old and 60 lbs of pure goodness and would love to find a home to live out the rest of his glory days. This ole guy has really proven that he has so much life and love to give! Whoever ends up adopting him will be so lucky.",
        "adoptable": false,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647550944/wbsquk0ypqmxbhitdbdw.jpg",
        "id": 9
      },
      {
        "name": "Nova",
        "ageId": 2,
        "sex": "Female",
        "bio": "Nova is one of our longest residents and I can’t believe her beautiful face has lasted this long here! She is a happy, playful girl who loves being the center of attention. She loves chewing on her toys and chasing after the ball. She has been in playgroups and does well with other dogs. She would make an awesome running buddy, but also wants to snuggle on the couch. She is known to be a great adventure companion - she does so well in the car!",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647549231/xjz08kklqiz9whwnweld.jpg",
        "id": 10
      },
      {
        "name": "Boss",
        "ageId": 1,
        "sex": "Male",
        "bio": "His name might be Boss, but this sweet fella is the kind of boss you will be happy spending lots and lots of time with outside of work hours. Boss is a playful guy and loves to run all over our play yard. It takes a little bit of time for him to warm up to you, but ounce he is comfortable Boss is a loving fella! He really enjoys chasing the tennis ball and does well on the leash. He is great with every dog that he meets!",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647550412/pe9yn8kblcj9gcdtq4kh.jpg",
        "id": 11
      },
      {
        "name": "Portland",
        "ageId": 2,
        "sex": "Female",
        "bio": "Portland is a super sweet girl who loves to play in the backyard and snuggle on the sofa with you! Portland is working hard on learning all of her basics skills.  We believe she will thrive in a home with no other dogs or cats. ",
        "adoptable": true,
        "rescueId": 3,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647550689/bwh0scpxlf6xusjy5nkr.png",
        "id": 12
      },
      {
        "name": "Corduroy",
        "ageId": 3,
        "sex": "Male",
        "bio": "The name is Corduroy and I'm truly the best boy. I might be on the older side, but I still like to play. My favorite thing is snuggling on the couch watching Downton Abbey. I think we'd make a great duo!",
        "adoptable": true,
        "rescueId": 3,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647459370/hrvntkfsdy74w4sxqfbj.png",
        "id": 13
      },
      {
        "name": "Coco",
        "ageId": 2,
        "sex": "Male",
        "bio": "Coco was the most shy boy I've ever met. At first, he was too scared to walk on a leash or even come over for treats. But after meeting his foster brother, he has made a complete turn around. He's the happiest boy and now he lives with his furever family!",
        "adoptable": false,
        "rescueId": 1,
        "userId": 1,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647628567/vbkghxjdzmzna73rwxw0.jpg",
        "id": 14
      },
      {
        "name": "Teddy",
        "ageId": 3,
        "sex": "Male",
        "bio": "Teddy is everyone's best friend. Need a chill dog to take to the park? To go grab a pint at a brewery? Snuggle buddy on a rainy day? Ted's your man.",
        "adoptable": false,
        "rescueId": 5,
        "userId": 7,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648063592/jlg4v0msel0txmagi3hp.jpg",
        "id": 15
      },
      {
        "name": "Pancake",
        "ageId": 2,
        "sex": "Male",
        "bio": "I was found running with the cars on the interstate and my owners never came to claim me. Idk why cause I'm the SWEETEST thicc boy you've ever met. My head is as big as watermelon but not as big as my heart. Come meet me and maybe we can be best friends!",
        "adoptable": false,
        "rescueId": 5,
        "userId": 1,
        "goodWKids": false,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647960668/krqzcca5d7d8xjr7e33j.jpg",
        "id": 16
      },
      {
        "name": "Missy",
        "ageId": 3,
        "sex": "Female",
        "bio": "Hi! I'm Missy and I just want to cuddle up on the couch watching tv with my new best friend (is it you??) YES IT IS!",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647981899/ywbjxv3lsouorr89mo0q.jpg",
        "id": 17
      },
      {
        "name": "Tater",
        "ageId": 2,
        "sex": "Male",
        "bio": "There’s no one like Tater! This absolutely precious 4-year-old bully mix greets every single person he meets with lots of love and kisses. Tater is a medium-energy guy who loves a good game of tug. It's his favorite! When it's cuddle time, Tater likes to sleep right next to you to make sure you're still there. He deserves nothing but the best so we are looking for an exceptional home for this sweet nugget.",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647982207/afqlh2gurqbnzv4qhp8x.jpg",
        "id": 18
      },
      {
        "name": "Alexis",
        "ageId": 1,
        "sex": "Female",
        "bio": "",
        "adoptable": false,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647459589/jxlb7pflvaai8kl8bccl.jpg",
        "id": 19
      },
      {
        "name": "Bruce",
        "ageId": 3,
        "sex": "Male",
        "bio": "Hiiiii",
        "adoptable": true,
        "rescueId": 3,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648139596/default_dxztcl.jpg",
        "id": 21
      },
      {
        "name": "Ava",
        "ageId": 2,
        "sex": "Female",
        "bio": "I am the OG. I am the best girl you'll ever meet. I'll play fetch all day everyday and then still have energy when we get home. I still like to snuggle up and watch tv with you too though. ",
        "adoptable": false,
        "rescueId": 5,
        "userId": 1,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648223865/en5ujtakgvzzzmbt94ul.jpg",
        "id": 22
      },
      {
        "name": "Bubbles",
        "ageId": 1,
        "sex": "Female",
        "bio": "Meet Bubbles! She's a 6 month old Catahoula mix who is as sweet as she is stunning. She's affectionate, spunky and intelligent. She absolutely loves other pups and would love a playmate in her forever home but would also do well as a solo pup with pup playdates! Her favorite activities are daily walks, adventure time outside and cuddle sessions on the couch once she gets her wiggles out. She is a quick learner and is catching on well to the basics. She's catching on to potty training with a consistent routine, walks well on the leash and is working on learning her crate is her safe space. Since she is young she will need adopters dedicated to continued training as she journeys through puppyhood! If you’re looking for an affectionate and playful pup to join your family, adopt Bubbles!",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648225506/neohnhsvp5ijmciwqwnj.jpg",
        "id": 23
      },
      {
        "name": "Maddie",
        "ageId": 2,
        "sex": "Female",
        "bio": "Meet Maddie! This beauty has been in our care since early February. We welcomed her into our program after she found herself in the shelter with a broken leg that needed repair. She’s since had surgery and she’s healing well and has the clear from her vet to start the process of finding her forever home! This girl loves people and does really well with other dogs - she is good at reading the room and knows when other dogs want to play and when they need space. She enjoys spending time outdoors and will make the best adventure buddy. If you’re someone who enjoys daily walks, runs, or hikes, she will gladly be by your side. Maddie is a young, active, and intelligent pup. There are few things Maddie loves more than playing with her tennis ball so as long as she has a ball to toss around or play fetch with, this girl will be endlessly entertained. While she enjoys a good game of fetch and loves outside time, she’s also quick to curl up next to you for a snooze. Maddie is very smart and learns quickly. Her foster says she knows “sit”, “wait”, “crate”, and “stay” pretty well. She is working on mastering “down”, but that one has been a new command since she was previously in a cast which made it tricky. Maddie is 100% potty trained and sleeps in the crate at night. She is working on leash skills and does well with a leader who can give her a little guidance and will be patient as she continues to regain full strength in her leg. If you’re looking for a loving young pup to add to your home, consider Maddie!",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648225599/y0d7ahmwje8mbqeebxg2.jpg",
        "id": 24
      },
      {
        "name": "Myrtle",
        "ageId": 1,
        "sex": "Female",
        "bio": "Meet Myrtle, par of the Spring Break Litter! This fun loving bunch are 8-week old, pittie mixes who are looking to bring some sunshine to your life. Since joining our program these nuggets have settled in nicely to their foster homes and have shown just how sweet, affectionate and playful they are. If their wrinkly faces aren't enough to win you over, their spunky and loving personalities should do the trick. They will need adopters who are excited about the joys and challenges that come along with raising a puppy but they will be oh so worth it! If you're looking for your new best friend, apply to adopt today!",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648225721/pwgpscccauujvncbqj1o.jpg",
        "id": 25
      },
      {
        "name": "Cleo",
        "ageId": 3,
        "sex": "Female",
        "bio": "",
        "adoptable": false,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648225826/i8zdcp5mlqwlw7xauosj.jpg",
        "id": 26
      },
      {
        "name": "Rose",
        "ageId": 1,
        "sex": "Female",
        "bio": "Rose was my second foster and she was the spunkiest girl. She previously had mange so her hair was slowly starting to grow back in, but that never slowed her down. She was always full of energy and ready to give you some kisses. She found her forever home in March of 2021.",
        "adoptable": false,
        "rescueId": 1,
        "userId": 1,
        "goodWKids": false,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648225982/zpqnxelzl56ckzkeoh1h.jpg",
        "id": 27
      },
      {
        "name": "Bella",
        "ageId": 1,
        "sex": "Female",
        "bio": "Bella was my third and shortest foster, but I fell in love with her so fast. She was as adorable as she was sweet. She was adopted in July of 2021 by her dad that actually found her roaming the streets. She now lives a perfect life with him!",
        "adoptable": false,
        "rescueId": 1,
        "userId": 1,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648226222/s5wz4tx0ifx1simo9xs8.jpg",
        "id": 28
      },
      {
        "name": "Rizzy",
        "ageId": 1,
        "sex": "Female",
        "bio": "Rizzy was my fourth foster. She came close to joining the family, but we found her the most perfect mom. They're both full of energy and love adventures.",
        "adoptable": false,
        "rescueId": 1,
        "userId": 1,
        "goodWKids": false,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648226336/zf6sb0f6kiesbalbgzko.jpg",
        "id": 29
      },
      {
        "name": "Ferguson",
        "ageId": 1,
        "sex": "Male",
        "bio": "Wolfhound, Irish / Collie, Border mix",
        "adoptable": false,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648226791/i3p4qsy7yzcvdxgiqgnm.jpg",
        "id": 30
      },
      {
        "name": "Harry",
        "ageId": 3,
        "sex": "Male",
        "bio": "10 year old Pinscher, Miniature / Mix",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": false,
        "goodWCats": true,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648226891/ck4wppxrbqpqgd6igefb.jpg",
        "id": 31
      },
      {
        "name": "Rosie",
        "ageId": 2,
        "sex": "Female",
        "bio": "Retriever, Chocolate Labrador\nHeartworm positive",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648226996/kzitvukyqyurczcyiqmh.jpg",
        "id": 32
      },
      {
        "name": "Maxwell",
        "ageId": 3,
        "sex": "Male",
        "bio": "Sweet, handsome Maxwell is planning to go big AND go home. At just over 70 pounds, he is a hunk of goofy velveteen love. This boy hasn’t met a form of love he doesn’t love.\n-giving kisses? He’d be happy to\n-getting kisses? That’s what noggins were made for\n-belly rubs? Anytime, anywhere\n-cuddles? Point him to the couch\n-treats? That’s just tiny tasty love\nMaxwell has done well around other dogs, both at the shelter and in his foster home. He is a polite house guest, and he has a goofy, sweet personality that is guaranteed to bring joy and laughter to your life.",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648227263/nozxsauq3mpbepl4ezmu.jpg",
        "id": 33
      },
      {
        "name": "Gus",
        "ageId": 3,
        "sex": "Male",
        "bio": "",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648744022/l5oqz2hwiozzok0kfoin.jpg",
        "id": 34
      },
      {
        "name": "Lee-Lah",
        "ageId": 2,
        "sex": "Female",
        "bio": "",
        "adoptable": false,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648227477/vkjebvqjcwste7i7rmqc.jpg",
        "id": 35
      },
      {
        "name": "Bruce",
        "ageId": 1,
        "sex": "Male",
        "bio": "",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648139596/default_dxztcl.jpg",
        "id": 36
      },
      {
        "name": "Biscuit Love",
        "ageId": 1,
        "sex": "Female",
        "bio": "Biscuit Love is a squishy T-Rex healing up from an ear infection along with 8 weeks of mange medicine to fix her neglected skin! She was found roaming Dickerson Pike and Lorraine Ave in East Nashville. She is 49 pounds and about 1.5 years old. She will be available for adoption after a clean bill of health!",
        "adoptable": true,
        "rescueId": 3,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648744406/u5beaojr6vgmcvxnefyy.png",
        "id": 37
      },
      {
        "name": "LuLu Bear",
        "ageId": 2,
        "sex": "Female",
        "bio": "LuLu is the sweetest! She is a bit shy at first, but warms up quickly. She would LOVE a quiet home with a soft sofa and bed. She is currently on hold as she's decompressing in her foster home.",
        "adoptable": true,
        "rescueId": 3,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648744886/omzoep3df1kmlgufjsah.png",
        "id": 38
      },
      {
        "name": "Sherlock",
        "ageId": 1,
        "sex": "Male",
        "bio": "Are you looking for a pup full of personality? Meet Sherlock!! This 1 year old, 66 lb guy is a total mixed breed. With his long legs, amazing ears and puppy dog eyes, this guy is sure to win you over. We aren’t sure his breed mix but he’s a cutie! He has settled in seamlessly to his foster home and his foster says he’d make a great best friend for a variety of adopters. His favorite pastimes are chasing tennis balls around the backyard, romping around with his foster sibling, and curling up with his fosters when the day’s activities are done. This boy loves being outside so having a backyard will get you extra brownie points in his book. Sherlock is such a loving, social pup and will adapt well into your pack if you have other pups but would also be just as happy as a solo pup as long as he gets the occasional play date with dog friends. Sherlock is potty trained, does well in his crate and is food-motivated and eager please! We absolutely love this sweet and silly guy and know his future home will enjoy his presence!",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745215/u5tg1voaiti3zw1gblus.jpg",
        "id": 39
      },
      {
        "name": "Bubba",
        "ageId": 2,
        "sex": "Male",
        "bio": "Our best buddy, Bubba, is looking for his forever home! This sweet boy is an angel and after spending some quality time with his foster soaking up all the love, he’s now ready to find his perfect match. Bubba has adjusted so well and really is the whole package! For everything this poor guys as been through, he is such a mush.\n\nBubba is 5 years old and 56 lbs. He is a laidback fella that enjoys a slow-paced life. He co-exists very well with other pups and would enjoy the company of another mellow friend, or he’ll gladly soak up all the attention for himself as a solo pup. Bubba is gentle and loving. He will try to give hugs any chance he gets and will try laying on your lap to get close to snuggle. He is potty trained, does well in his crate, and his foster says he is food-motivated and easily trainable. Bubba minds his manners in the house and really just wants to cuddle and/or nap all day. He enjoys being near his people but is also comfortable and confident being independent as needed. His daily routine includes a stroll around the block and hanging out, lounging, napping in his crate, and entertaining himself with his toys. When he ventures around the block on his walks, he wants to say hi to everyone and is working on not pulling on the leash. He’s a pretty strong guy so will need an adopter who is excited to help him with his leash skills. Bubba is eager to please so he’s receptive to leadership and guidance. With a little work, we imagine he’ll be a pro in no time. If you’re looking for a chill guy with a big heart to add to your home, consider adopting Bubba!",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745311/hci9acpe8gjyafh5yqwd.jpg",
        "id": 40
      },
      {
        "name": "Snickerdoodle",
        "ageId": 1,
        "sex": "Female",
        "bio": "Meet the Cookie litter! They’re 8-week old, collie mix puppies who are sweeter than sugar. They are playful, affectionate and social and we have no doubt they’ll be the best additions to their forever homes. The collie breed is known to be extremely intelligent and active, so these pups will need homes excited to take on the needs of a working pup that does well stimulation. They’ll likely be happiest with backyards to romp around or an active adopter looking for their new adventure buddy. These cuties are the most amazing little pups who will bring so much joy to a home who is looking forward to the joys and challenges that puppyhood brings.",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745407/ozofoxoq0vof2hjbjhzw.jpg",
        "id": 41
      },
      {
        "name": "Livy",
        "ageId": 2,
        "sex": "Female",
        "bio": "",
        "adoptable": true,
        "rescueId": 4,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745483/ooqqsb6bjvlope4lm7ij.jpg",
        "id": 42
      },
      {
        "name": "Canelo",
        "ageId": 2,
        "sex": "Male",
        "bio": "I am about six years old and I am a neutered, male. If you are looking for a calm sweet BFF I’m your guy! I can be a bit shy at first but once I get to know you, I’m all cuddles! I have a happy wiggly butt when I am getting attention from humans! I love treats and I will happily sit for one! I am kennel trained and good on the leash! I am ready to find my furever home today",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745573/jwiklord6cxxtof9yowh.jpg",
        "id": 43
      },
      {
        "name": "Kevin",
        "ageId": 1,
        "sex": "Male",
        "bio": "I have been told I look like a brown teddy bear! I am a sweet and easy going dog. I am eager to sit for a treat and learn more tricks! I am good with other dogs and love playtime in the yard here at the shelter. I'm looking for my perfect home and I hope that's you!",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745709/ataavywmico0sedb1ger.jpg",
        "id": 44
      },
      {
        "name": "Glimmer",
        "ageId": 3,
        "sex": "Female",
        "bio": "I’m about 8 years old and I’m a spayed female. The volunteers say that I walk nicely on the leash. I am very smart! I will sit in command and I am very gentle when taking treats from my human! I am a cuddle bug and I can’t wait to find my furever home",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745787/lnjrsjqcqeuwogmgpnw2.jpg",
        "id": 45
      },
      {
        "name": "Finley",
        "ageId": 1,
        "sex": "Male",
        "bio": "",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745920/aswrm0ewze7tnecmfeks.jpg",
        "id": 46
      },
      {
        "name": "Dale",
        "ageId": 1,
        "sex": "Male",
        "bio": "Hi I am Dale. I am really sweet and loving, I love to give kisses and I love praise and treats. I am a pretty smart guy and I already know how to sit, and lie down when I'm asked to. My foster mom says that I would probably do long division for a treat. I like to run and chase a ball in the back yard and I LOVE hard chew toys like a Kong. I am still learning manners but do most of my business outside like a good boy. My foster mom says I am so smart that any accidents would be easily corrected with some love, training and consistency.\n\nI really like my foster sister dog, she's calm and nice to me and we had fun running and playing in the back yard. I also like to chase cats, so I would be better in a home without them.\n\nPlease give me a chance. I am a really sweet good boy with lots of love to give!",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648745999/zdzwd87wlz46jeyhedhw.jpg",
        "id": 47
      },
      {
        "name": "Ajax",
        "ageId": 1,
        "sex": "Male",
        "bio": "Ajax is one BIG puppy. All of one year old and filled with energy. Very smart; sits for treats and takes them gently! Loves to play fetch. Visit MACC today to adopt Ajax!",
        "adoptable": true,
        "rescueId": 1,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648746063/qlrcx5maiik78erear1i.jpg",
        "id": 48
      },
      {
        "name": "Jojo",
        "ageId": 1,
        "sex": "Female",
        "bio": "Jojo has become outgoing and friendly, curious about everything. She eats really quickly, so I got her some puzzle game toys and a slow feeder bowl. She figured out level 1 & 2 puzzle games really quickly and could probably figure out the third level with some more time. She loves playing with her buddy Etta (sibling) and they love taking naps together. Both Jojo & Etta have met my dog who is a 45 pound lab/border collie mix and were friendly with her so they'd probably be fine with other dogs.",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648746180/my3rim0jwvkogztmukjr.jpg",
        "id": 49
      },
      {
        "name": "Snoopy Titan",
        "ageId": 2,
        "sex": "Male",
        "bio": "",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648746267/rff1bt6okyhbwc2ff8q0.jpg",
        "id": 50
      },
      {
        "name": "Griffin",
        "ageId": 1,
        "sex": "Male",
        "bio": "",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 3,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648746332/tdtsobmt3pwdfrcjsbu7.jpg",
        "id": 51
      },
      {
        "name": "Voodoo",
        "ageId": 1,
        "sex": "Male",
        "bio": "",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648746393/hubtf72zgaozinux3sxo.jpg",
        "id": 52
      },
      {
        "name": "Brave Little Toaster",
        "ageId": 2,
        "sex": "Female",
        "bio": "Pet of the Week!",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": true,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648746460/rxkenawmwusiion0uqtz.jpg",
        "id": 53
      },
      {
        "name": "Ansel",
        "ageId": 1,
        "sex": "Male",
        "bio": "",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": true,
        "goodWDogs": true,
        "goodWCats": true,
        "sizeId": 1,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648746516/n9bgufmdrsiymijjiyvn.jpg",
        "id": 54
      },
      {
        "name": "Luna Lovegood",
        "ageId": 2,
        "sex": "Female",
        "bio": "",
        "adoptable": true,
        "rescueId": 2,
        "userId": 2,
        "goodWKids": false,
        "goodWDogs": false,
        "goodWCats": false,
        "sizeId": 2,
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1648746602/lizlns7dshw81vxuduko.jpg",
        "id": 55
      }
    ],
    "users": [
      {
        "id": 1,
        "firstName": "Hilary",
        "lastName": "Shaner",
        "email": "hs@gmail.com",
        "foster": false,
        "bio": "Hello! I'm Hilary and I want to live on a farm with 20 dogs"
      },
      {
        "firstName": "Automated",
        "lastName": "User",
        "email": "au@gmail.com",
        "foster": true,
        "bio": "manager inputted dogs",
        "id": 2
      },
      {
        "firstName": "Sarah",
        "lastName": "Jordan",
        "email": "sj@gmail.com",
        "foster": false,
        "bio": "Cats > Dogs but dogs are cool too I guess",
        "id": 3
      },
      {
        "firstName": "Leslie",
        "lastName": "Knope",
        "email": "lk@gmail.com",
        "foster": true,
        "bio": "Leslie Knope for President! I'll fill the White House with animals from the shelter!",
        "id": 4
      },
      {
        "firstName": "David",
        "lastName": "Rose",
        "email": "dr@gmail.com",
        "foster": true,
        "bio": "Ew, cats!",
        "id": 5
      },
      {
        "firstName": "Dwight",
        "lastName": "Schrute",
        "email": "ds@gmail.com",
        "foster": true,
        "bio": "Fact, bears eat beets. Bears, beets, Battlestar Galactica.",
        "id": 6
      },
      {
        "bio": "Hi, I’m Chandler. I make jokes when I’m uncomfortable. Can I interest you in a sarcastic comment?",
        "firstName": "Chandler",
        "lastName": "Bing",
        "foster": true,
        "email": "cb@gmail.com",
        "id": 7
      },
      {
        "firstName": "Sarah",
        "lastName": "Fittro",
        "email": "sf@gmail.com",
        "bio": "I love dogs",
        "foster": false,
        "id": 8
      }
    ],
    "rescues": [
      {
        "id": 1,
        "name": "Metro Animal Care and Control",
        "address": "5125 Harding Place Nashville, TN 37211",
        "email": "foster.macc@nashville.gov"
      },
      {
        "id": 2,
        "name": "Nashville Humane Association",
        "address": "213 Oceola Avenue Nashville, TN 37209",
        "email": "adopt@nashvillehumane.org"
      },
      {
        "id": 3,
        "name": "Nashville PITTIE",
        "address": "PO Box 413 LaVergne, TN 37086",
        "email": "info@nashvillepittie.org"
      },
      {
        "id": 4,
        "name": "Wags and Walks - Nashville",
        "address": "2236 Federal Ave Los Angeles, CA 90064",
        "email": "nashville@wagsandwalks.org"
      },
      {
        "id": 5,
        "name": "Other",
        "address": "",
        "email": ""
      }
    ],
    "sizes": [
      {
        "id": 1,
        "type": "Small (1-19 lbs)"
      },
      {
        "id": 2,
        "type": "Medium (20-59 lbs)"
      },
      {
        "id": 3,
        "type": "Large (60+ lbs)"
      }
    ],
    "ages": [
      {
        "id": 1,
        "range": "Puppy (0-2 years)"
      },
      {
        "id": 2,
        "range": "Adult (3-7 years)"
      },
      {
        "id": 3,
        "range": "Senior (8+ years)"
      }
    ],
    "events": [
      {
        "id": 1,
        "title": "W&W Training Classes",
        "date": "June 12, 2022",
        "time": "11:00 AM - 12:00 PM",
        "location": "2320 2 Rivers Parkway Nashville, TN",
        "description": "Say It Once Dog Training is doing an Alumni Only Pack Walk this Saturday, April 2nd at 11 am at The Two Rivers Trailhead Parking lot! This class will be for dogs over 6 months of age (YES you bring your dog!) and will include walking tips, obedience training, and socialization. If you struggle to walk your pup in public, improve on their leash manners, or simply need a refresh - this is for you! The training session will require a $30 donation that goes back to our rescue pups. If you would like to join, please click here to make a reservation as spots are limited! ",
        "rescueId": 4
      },
      {
        "id": 2,
        "title": "MACC Foster Open House",
        "date": "July 23, 2022",
        "time": "2:00 PM",
        "location": "Metro Animal Care and Control",
        "description": "We have plenty of pets in need of a loving foster home, so stop by our Foster Open House to meet a few of them! Learn about our foster program and take a foster dog or cat home that day! We will make sure you have all the food and supplies to make your home the perfect place for a foster pet.",
        "rescueId": 1
      },
      {
        "id": 3,
        "title": "2022 Mutt Strutt",
        "date": "August 30, 2022",
        "time": "TBD",
        "location": "Shelby Bottoms Park",
        "description": "Every year at the Music City Mutt Strutt more than 1,000 people and pooches alike will gather to strut their stuff for a great cause! All money raised through the Mutt Strutt enables the Nashville Humane Association to provide care and love to the animals entrusted to us each day. The event is outdoors, fun for the whole family and we will be awarding medals to all runners and special prizes at the event.",
        "rescueId": 2
      },
      {
        "id": 4,
        "title": "34th Annual Cause for Paws",
        "date": "September 28, 2022",
        "time": "TBD",
        "location": "Belle Meade Country Club",
        "description": "The annual kick-off to spring, Cause for Paws Fashion Show and Luncheon is one of Nashville Humane Association’s largest fundraisers. Held at the Belle Meade Country Club, guests enjoy a spring fashion show a delicious lunch and a silent auction with fantastic items.",
        "rescueId": 2
      },
      {
        "id": 5,
        "title": "2022 Dog Day Festival",
        "date": "October 15, 2022",
        "time": "All Day",
        "location": "Centennial Park (2500 West End Ave)",
        "description": "Join thousands of Nashvillians and their furry companions for a day jam packed with four-legged fun. Bring your pooches and participate in activities such as a costume contest, pupper parade, training classes, demonstrations, contests and pet portraits, or enjoy the children’s area and various demonstrations. There will be a low-cost Microchip Clinic, food trucks, door prizes, fun zones, live entertainment/music and so much more! Dog Day Festival, Nashville’s longest running dog festival, is a celebration of everything pup and all proceeds go to benefit the Nashville Humane Association.",
        "rescueId": 2
      }
    ],
    "blogPosts": [
      {
        "userId": 5,
        "title": "Coco's adopted!",
        "entryText": "After three months with our foster boy he has finally found the perfect family! He will have three brothers to run around with and continue to build his confidence. We couldn't be more exited for him.",
        "dogId": 7,
        "date": "3/16/2022",
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647460437/yrooudp4izlefke0gvn3.jpg",
        "id": 1
      },
      {
        "userId": 1,
        "title": "Bax Approved",
        "entryText": "Baxter had the best day today. It was sunny and 70 and he ran ran ran all day. He still had some goofy energy when we came inside too.",
        "dogId": 1,
        "date": "4/4/2022",
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647460236/xvd2jpcjl1c764xhtuq6.jpg",
        "id": 2
      },
      {
        "userId": 8,
        "title": "Pupcups > thunderstorms",
        "entryText": "There was a huge storm yesterday and Teddy hid under the bed all day. We even lost power for a bit. So to make up for it we took Ted to get a pupcup from Starbucks (his favorite). He said he'll think about forgiving us for letting the storm happen.",
        "dogId": 15,
        "date": "3/24/2022",
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647545246/aovapvskvyydod8vqlbt.jpg",
        "id": 3
      },
      {
        "userId": 6,
        "title": "That's so fetch!",
        "entryText": "Today we discovered just how much Destiny loves to play fetch! She doesn't always want to give the ball back, but she's learning so fast.",
        "dogId": 10,
        "date": "3/18/2022",
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647627938/eissfuk0tyfhpvwsj9od.jpg",
        "id": 4
      },
      {
        "userId": 8,
        "title": "Cutest pup-kins in the patch",
        "entryText": "Halloween is my favorite holiday so naturally it's also the pups. They wanted to dress up like the super hero's they are. ",
        "dogId": 15,
        "date": "3/24/2022",
        "imageURL": "https://res.cloudinary.com/dfxsl6a2c/image/upload/v1647630027/dqin5rfvk8xrtwaqsz5n.jpg",
        "id": 5
      }
    ]
  }